In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv("C:\\Users\\Abhay\\Downloads\\income.csv")
data

    customer_id  gender  age  income
0      CUST0001    Male   21  148348
1      CUST0002  Female   33  138960
2      CUST0003  Female   31   96376
3      CUST0004    Male   36   52197
4      CUST0005    Male   44  100371
..          ...     ...  ...     ...
145    CUST0146  Female   38   61859
146    CUST0147    Male   20  118635
147    CUST0148  Female   27   23618
148    CUST0149    Male   28   29722
149    CUST0150    Male   32  144269

[150 rows x 4 columns]

In [3]:
#DATA PREPROCESSING
data.head()

  customer_id  gender  age  income
0    CUST0001    Male   21  148348
1    CUST0002  Female   33  138960
2    CUST0003  Female   31   96376
3    CUST0004    Male   36   52197
4    CUST0005    Male   44  100371

In [4]:
data.tail()

    customer_id  gender  age  income
145    CUST0146  Female   38   61859
146    CUST0147    Male   20  118635
147    CUST0148  Female   27   23618
148    CUST0149    Male   28   29722
149    CUST0150    Male   32  144269

In [5]:
data.describe(include="all")

       customer_id  gender        age         income
count          150     150  150.00000     150.000000
unique         150       2        NaN            NaN
top       CUST0121  Female        NaN            NaN
freq             1      79        NaN            NaN
mean           NaN     NaN   42.94000   84204.726667
std            NaN     NaN   15.20298   36632.330225
min            NaN     NaN   18.00000   20432.000000
25%            NaN     NaN   30.00000   56198.500000
50%            NaN     NaN   44.00000   84135.500000
75%            NaN     NaN   54.00000  112590.750000
max            NaN     NaN   70.00000  148955.000000

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  150 non-null    object
 1   gender       150 non-null    object
 2   age          150 non-null    int64
 3   income       150 non-null    int64
dtypes: int64(2), object(2)
memory usage: 4.8+ KB

In [8]:
data.shape

(150, 4)

In [10]:
data.dtypes

customer_id    object
gender         object
age             int64
income          int64
dtype: object

In [11]:
data.columns

Index(['customer_id', 'gender', 'age', 'income'], dtype='object')

In [12]:
data.isnull()

     customer_id  gender    age  income
0          False   False  False   False
1          False   False  False   False
2          False   False  False   False
3          False   False  False   False
4          False   False  False   False
..           ...     ...    ...     ...
145        False   False  False   False
146        False   False  False   False
147        False   False  False   False
148        False   False  False   False
149        False   False  False   False

[150 rows x 4 columns]

In [13]:
data.isna()

     customer_id  gender    age  income
0          False   False  False   False
1          False   False  False   False
2          False   False  False   False
3          False   False  False   False
4          False   False  False   False
..           ...     ...    ...     ...
145        False   False  False   False
146        False   False  False   False
147        False   False  False   False
148        False   False  False   False
149        False   False  False   False

[150 rows x 4 columns]

In [14]:
data.isnull().any()

customer_id    False
gender         False
age            False
income         False
dtype: bool

In [15]:
data.isnull().sum()

customer_id    0
gender         0
age            0
income         0
dtype: int64

In [17]:
#calculating the statistics

In [18]:
#finding out the mean

In [19]:
data['age'].mean()

42.94

In [20]:
data['income'].mean()

84204.72666666667

In [21]:
data['customer_id'].count().mean()

150.0

In [27]:
data.select_dtypes(include=np.number).mean()

age          42.940000
income    84204.726667
dtype: float64

In [28]:
#calculation of the median

In [30]:
data['age'].median()

44.0

In [31]:
data['income'].median()

84135.5

In [33]:
data.select_dtypes(include=np.number).median()

age          44.0
income    84135.5
dtype: float64

In [34]:
data.mode()

    customer_id  gender   age  income
0      CUST0001  Female  27.0   20432
1      CUST0002     NaN   NaN   21144
2      CUST0003     NaN   NaN   22403
3      CUST0004     NaN   NaN   23618
4      CUST0005     NaN   NaN   23900
..          ...     ...   ...     ...
145    CUST0146     NaN   NaN  148348
146    CUST0147     NaN   NaN  148491
147    CUST0148     NaN   NaN  148704
148    CUST0149     NaN   NaN  148819
149    CUST0150     NaN   NaN  148955

[150 rows x 4 columns]

In [35]:
data['age'].mode()

0    27
dtype: int64

In [38]:
data.min()

customer_id    CUST0001
gender           Female
age                  18
income            20432
dtype: object

In [39]:
data.max()

customer_id    CUST0150
gender             Male
age                  70
income           148955
dtype: object

In [40]:
#Calculating standard deviation

In [43]:
data.select_dtypes(include=np.number).std()

age          15.202980
income    36632.330225
dtype: float64

In [44]:
data['age'].std()

15.202980103481215

In [45]:
data['income'].std()

36632.33022541126

In [46]:
data.groupby(['gender']).mean()

              age        income
gender
Female  43.493671  84121.329114
Male    42.323944  84297.521127

In [47]:
data.groupby(['gender']).median()

        age  income
gender
Female   45   80494
Male     43   89141

In [49]:
data.groupby(['gender'])['age'].mean()

gender
Female    43.493671
Male      42.323944
Name: age, dtype: float64

In [50]:
data.groupby(['gender'])['age'].median()

gender
Female    45
Male      43
Name: age, dtype: int64

In [51]:
data.groupby(['gender'])['age'].std()

gender
Female    14.811528
Male      15.709665
Name: age, dtype: float64

In [52]:
data.groupby(['gender'])['age'].max()

gender
Female    70
Male      70
Name: age, dtype: int64

In [53]:
data.groupby(['gender'])['age'].min()

gender
Female    18
Male      18
Name: age, dtype: int64

In [54]:
data.groupby(['gender'])['income'].mean()

gender
Female    84121.329114
Male      84297.521127
Name: income, dtype: float64

In [55]:
data.groupby(['gender'])['age'].median()

gender
Female    45
Male      43
Name: age, dtype: int64

In [56]:
data.groupby(['gender'])['age'].std()

gender
Female    14.811528
Male      15.709665
Name: age, dtype: float64

In [57]:
#part2 of the experiment

In [59]:
irisset=pd.read_csv("C:\\Users\\Abhay\\Downloads\\IRIS.csv")
irisset

     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [60]:
irisset.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [61]:
irisset.tail()

     sepal_length  sepal_width  petal_length  petal_width         species
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

In [62]:
irisset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [63]:
irisset.shape

(150, 5)

In [64]:
irisset.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [65]:
irisset.describe(include="all")

        sepal_length  sepal_width  petal_length  petal_width          species
count     150.000000   150.000000    150.000000   150.000000              150
unique           NaN          NaN           NaN          NaN                3
top              NaN          NaN           NaN          NaN  Iris-versicolor
freq             NaN          NaN           NaN          NaN               50
mean        5.843333     3.054000      3.758667     1.198667              NaN
std         0.828066     0.433594      1.764420     0.763161              NaN
min         4.300000     2.000000      1.000000     0.100000              NaN
25%         5.100000     2.800000      1.600000     0.300000              NaN
50%         5.800000     3.000000      4.350000     1.300000              NaN
75%         6.400000     3.300000      5.100000     1.800000              NaN
max         7.900000     4.400000      6.900000     2.500000              NaN

In [66]:
setosa=(irisset['species']=='Iris-setosa')

In [68]:
print('IRIS SETOSA')
print(irisset[setosa].describe())

IRIS SETOSA
       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        5.00600     3.418000      1.464000      0.24400
std         0.35249     0.381024      0.173511      0.10721
min         4.30000     2.300000      1.000000      0.10000
25%         4.80000     3.125000      1.400000      0.20000
50%         5.00000     3.400000      1.500000      0.20000
75%         5.20000     3.675000      1.575000      0.30000
max         5.80000     4.400000      1.900000      0.60000

In [69]:
virginica=(irisset['species']=='Iris-virginica')
print('Iris-virginica')
print(irisset[virginica].describe())

Iris-virginica
       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        6.58800     2.974000      5.552000      2.02600
std         0.63588     0.322497      0.551895      0.27465
min         4.90000     2.200000      4.500000      1.40000
25%         6.22500     2.800000      5.100000      1.80000
50%         6.50000     3.000000      5.550000      2.00000
75%         6.90000     3.175000      5.875000      2.30000
max         7.90000     3.800000      6.900000      2.50000

In [73]:
summary_stats = irisset.groupby("species").agg({"sepal_length": ['mean', 'median', 'min', 'max', 'std']})
print("Summary Statistics for Sepal length Grouped by Species:\n", summary_stats)

Summary Statistics for Sepal length Grouped by Species:
                 sepal_length
                        mean median  min  max       std
species
Iris-setosa            5.006    5.0  4.3  5.8  0.352490
Iris-versicolor        5.936    5.9  4.9  7.0  0.516171
Iris-virginica         6.588    6.5  4.9  7.9  0.635880

In [75]:
summary_stats = irisset.groupby("species").agg({"sepal_width": ['mean', 'median', 'min', 'max', 'std']})
print("Summary Statistics for Sepal width Grouped by Species:\n", summary_stats)

Summary Statistics for Sepal width Grouped by Species:
                 sepal_width
                       mean median  min  max       std
species
Iris-setosa           3.418    3.4  2.3  4.4  0.381024
Iris-versicolor       2.770    2.8  2.0  3.4  0.313798
Iris-virginica        2.974    3.0  2.2  3.8  0.322497

In [76]:
summary_stats = irisset.groupby("species").agg({"petal_length": ['mean', 'median', 'min', 'max', 'std']})
print("Summary Statistics for petal length Grouped by Species:\n", summary_stats)

Summary Statistics for petal length Grouped by Species:
                 petal_length
                        mean median  min  max       std
species
Iris-setosa            1.464   1.50  1.0  1.9  0.173511
Iris-versicolor        4.260   4.35  3.0  5.1  0.469911
Iris-virginica         5.552   5.55  4.5  6.9  0.551895

In [77]:
summary_stats = irisset.groupby("species").agg({"petal_width": ['mean', 'median', 'min', 'max', 'std']})
print("Summary Statistics for petal width Grouped by Species:\n", summary_stats)

Summary Statistics for petal width Grouped by Species:
                 petal_width
                       mean median  min  max       std
species
Iris-setosa           0.244    0.2  0.1  0.6  0.107210
Iris-versicolor       1.326    1.3  1.0  1.8  0.197753
Iris-virginica        2.026    2.0  1.4  2.5  0.274650